console.log("05 JS Statements");

let x, y, z; // statement 1
x = 5; // statement 2
y = 6; // statement 3
z = x + y; // statement 4

let person = "Hege";

let keywords = {
    'var': "декларирует переменную",
    'let': "декларирует блоковую переменную",
    'const': "декларирует блоковую константу",
    'if': "маркер блока инструкций, которые выполняются по условию",
    'switch': "маркер блока инструкций, которые выполняются в разных случаях",
    'for': "маркер блока инструкций, который выполняется несколько раз",
    'while': "маркер блока инструкций, который выполняется до тех пор, пока условие истинно",
    'function': "декларация функции",
    'return': "возвращает значение из функции",
    'break': "выход из цикла",
    'continue': "переход к следующей итерации цикла",
    'throw': "выбрасывает исключение",
    'try': "блок кода, который может вызвать исключение",
};
console.table(keywords);

